###################################################################

# Created by write_sdc on Thu Nov 14 18:49:34 2024

###################################################################
set sdc_version 2.1

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current mA
set_max_capacitance 0.5 [current_design]
set_max_transition 1.5 [current_design]
set_load -pin_load 0.2 [get_ports {floor[2]}]
set_load -pin_load 0.2 [get_ports {floor[1]}]
set_load -pin_load 0.2 [get_ports {floor[0]}]
set_load -pin_load 0.2 [get_ports door]
set_load -pin_load 0.2 [get_ports {elevator_button_out[2]}]
set_load -pin_load 0.2 [get_ports {elevator_button_out[1]}]
set_load -pin_load 0.2 [get_ports {elevator_button_out[0]}]
set_load -pin_load 0.2 [get_ports {floor_button_out[3]}]
set_load -pin_load 0.2 [get_ports {floor_button_out[2]}]
set_load -pin_load 0.2 [get_ports {floor_button_out[1]}]
set_load -pin_load 0.2 [get_ports {floor_button_out[0]}]
set_max_fanout 1 [get_ports clk]
set_max_fanout 1 [get_ports rst_n]
set_max_fanout 1 [get_ports {elevator_floor_button_pressed[2]}]
set_max_fanout 1 [get_ports {elevator_floor_button_pressed[1]}]
set_max_fanout 1 [get_ports {elevator_floor_button_pressed[0]}]
set_max_fanout 1 [get_ports {floor_button_pressed[3]}]
set_max_fanout 1 [get_ports {floor_button_pressed[2]}]
set_max_fanout 1 [get_ports {floor_button_pressed[1]}]
set_max_fanout 1 [get_ports {floor_button_pressed[0]}]
create_clock [get_ports clk]  -period 10  -waveform {0 5}
set_clock_latency 1  [get_clocks clk]
set_clock_uncertainty -setup 0.7  [get_clocks clk]
set_clock_uncertainty -hold 0.5  [get_clocks clk]
set_clock_transition -max -rise 0.1 [get_clocks clk]
set_clock_transition -min -rise 0.1 [get_clocks clk]
set_clock_transition -max -fall 0.12 [get_clocks clk]
set_clock_transition -min -fall 0.12 [get_clocks clk]
create_clock -name v_clk  -period 10  -waveform {0 5}
set_input_delay -clock v_clk  1  [get_ports rst_n]
set_input_delay -clock v_clk  1  [get_ports {elevator_floor_button_pressed[2]}]
set_input_delay -clock v_clk  1  [get_ports {elevator_floor_button_pressed[1]}]
set_input_delay -clock v_clk  1  [get_ports {elevator_floor_button_pressed[0]}]
set_input_delay -clock v_clk  1  [get_ports {floor_button_pressed[3]}]
set_input_delay -clock v_clk  1  [get_ports {floor_button_pressed[2]}]
set_input_delay -clock v_clk  1  [get_ports {floor_button_pressed[1]}]
set_input_delay -clock v_clk  1  [get_ports {floor_button_pressed[0]}]
set_output_delay -clock v_clk  1  [get_ports {floor[2]}]
set_output_delay -clock v_clk  1  [get_ports {floor[1]}]
set_output_delay -clock v_clk  1  [get_ports {floor[0]}]
set_output_delay -clock v_clk  1  [get_ports door]
set_output_delay -clock v_clk  1  [get_ports {elevator_button_out[2]}]
set_output_delay -clock v_clk  1  [get_ports {elevator_button_out[1]}]
set_output_delay -clock v_clk  1  [get_ports {elevator_button_out[0]}]
set_output_delay -clock v_clk  1  [get_ports {floor_button_out[3]}]
set_output_delay -clock v_clk  1  [get_ports {floor_button_out[2]}]
set_output_delay -clock v_clk  1  [get_ports {floor_button_out[1]}]
set_output_delay -clock v_clk  1  [get_ports {floor_button_out[0]}]
set_input_transition -max -rise 0.1  [get_ports clk]
set_input_transition -max -fall 0.12  [get_ports clk]
set_input_transition -min -rise 0.1  [get_ports clk]
set_input_transition -min -fall 0.12  [get_ports clk]
set_input_transition -max -rise 0.1  [get_ports rst_n]
set_input_transition -max -fall 0.12  [get_ports rst_n]
set_input_transition -min -rise 0.1  [get_ports rst_n]
set_input_transition -min -fall 0.12  [get_ports rst_n]
set_input_transition -max -rise 0.1  [get_ports {elevator_floor_button_pressed[2]}]
set_input_transition -max -fall 0.12  [get_ports {elevator_floor_button_pressed[2]}]
set_input_transition -min -rise 0.1  [get_ports {elevator_floor_button_pressed[2]}]
set_input_transition -min -fall 0.12  [get_ports {elevator_floor_button_pressed[2]}]
set_input_transition -max -rise 0.1  [get_ports {elevator_floor_button_pressed[1]}]
set_input_transition -max -fall 0.12  [get_ports {elevator_floor_button_pressed[1]}]
set_input_transition -min -rise 0.1  [get_ports {elevator_floor_button_pressed[1]}]
set_input_transition -min -fall 0.12  [get_ports {elevator_floor_button_pressed[1]}]
set_input_transition -max -rise 0.1  [get_ports {elevator_floor_button_pressed[0]}]
set_input_transition -max -fall 0.12  [get_ports {elevator_floor_button_pressed[0]}]
set_input_transition -min -rise 0.1  [get_ports {elevator_floor_button_pressed[0]}]
set_input_transition -min -fall 0.12  [get_ports {elevator_floor_button_pressed[0]}]
set_input_transition -max -rise 0.1  [get_ports {floor_button_pressed[3]}]
set_input_transition -max -fall 0.12  [get_ports {floor_button_pressed[3]}]
set_input_transition -min -rise 0.1  [get_ports {floor_button_pressed[3]}]
set_input_transition -min -fall 0.12  [get_ports {floor_button_pressed[3]}]
set_input_transition -max -rise 0.1  [get_ports {floor_button_pressed[2]}]
set_input_transition -max -fall 0.12  [get_ports {floor_button_pressed[2]}]
set_input_transition -min -rise 0.1  [get_ports {floor_button_pressed[2]}]
set_input_transition -min -fall 0.12  [get_ports {floor_button_pressed[2]}]
set_input_transition -max -rise 0.1  [get_ports {floor_button_pressed[1]}]
set_input_transition -max -fall 0.12  [get_ports {floor_button_pressed[1]}]
set_input_transition -min -rise 0.1  [get_ports {floor_button_pressed[1]}]
set_input_transition -min -fall 0.12  [get_ports {floor_button_pressed[1]}]
set_input_transition -max -rise 0.1  [get_ports {floor_button_pressed[0]}]
set_input_transition -max -fall 0.12  [get_ports {floor_button_pressed[0]}]
set_input_transition -min -rise 0.1  [get_ports {floor_button_pressed[0]}]
set_input_transition -min -fall 0.12  [get_ports {floor_button_pressed[0]}]
