###################################################################

# Created by write_sdc on Tue Nov 12 14:13:59 2024

###################################################################
set sdc_version 2.1

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current mA
set_max_capacitance 0.5 [current_design]
set_max_transition 1.5 [current_design]
set_load -pin_load 0.2 [get_ports {mem_addr[7]}]
set_load -pin_load 0.2 [get_ports {mem_addr[6]}]
set_load -pin_load 0.2 [get_ports {mem_addr[5]}]
set_load -pin_load 0.2 [get_ports {mem_addr[4]}]
set_load -pin_load 0.2 [get_ports {mem_addr[3]}]
set_load -pin_load 0.2 [get_ports {mem_addr[2]}]
set_load -pin_load 0.2 [get_ports {mem_addr[1]}]
set_load -pin_load 0.2 [get_ports {mem_addr[0]}]
set_max_fanout 1 [get_ports clk]
set_max_fanout 1 [get_ports rst_n]
set_max_fanout 1 [get_ports update_msbs]
set_max_fanout 1 [get_ports update_lsbs]
set_max_fanout 1 [get_ports jump]
set_max_fanout 1 [get_ports {jump_destination[5]}]
set_max_fanout 1 [get_ports {jump_destination[4]}]
set_max_fanout 1 [get_ports {jump_destination[3]}]
set_max_fanout 1 [get_ports {jump_destination[2]}]
set_max_fanout 1 [get_ports {jump_destination[1]}]
set_max_fanout 1 [get_ports {jump_destination[0]}]
set_max_fanout 1 [get_ports branch]
set_max_fanout 1 [get_ports {branch_offset[5]}]
set_max_fanout 1 [get_ports {branch_offset[4]}]
set_max_fanout 1 [get_ports {branch_offset[3]}]
set_max_fanout 1 [get_ports {branch_offset[2]}]
set_max_fanout 1 [get_ports {branch_offset[1]}]
set_max_fanout 1 [get_ports {branch_offset[0]}]
create_clock [get_ports clk]  -period 10  -waveform {0 5}
set_clock_latency 1  [get_clocks clk]
set_clock_uncertainty -setup 0.7  [get_clocks clk]
set_clock_uncertainty -hold 0.5  [get_clocks clk]
set_clock_transition -max -rise 0.1 [get_clocks clk]
set_clock_transition -min -rise 0.1 [get_clocks clk]
set_clock_transition -max -fall 0.12 [get_clocks clk]
set_clock_transition -min -fall 0.12 [get_clocks clk]
create_clock -name v_clk  -period 10  -waveform {0 5}
set_input_delay -clock v_clk  1  [get_ports rst_n]
set_input_delay -clock v_clk  1  [get_ports update_msbs]
set_input_delay -clock v_clk  1  [get_ports update_lsbs]
set_input_delay -clock v_clk  1  [get_ports jump]
set_input_delay -clock v_clk  1  [get_ports {jump_destination[5]}]
set_input_delay -clock v_clk  1  [get_ports {jump_destination[4]}]
set_input_delay -clock v_clk  1  [get_ports {jump_destination[3]}]
set_input_delay -clock v_clk  1  [get_ports {jump_destination[2]}]
set_input_delay -clock v_clk  1  [get_ports {jump_destination[1]}]
set_input_delay -clock v_clk  1  [get_ports {jump_destination[0]}]
set_input_delay -clock v_clk  1  [get_ports branch]
set_input_delay -clock v_clk  1  [get_ports {branch_offset[5]}]
set_input_delay -clock v_clk  1  [get_ports {branch_offset[4]}]
set_input_delay -clock v_clk  1  [get_ports {branch_offset[3]}]
set_input_delay -clock v_clk  1  [get_ports {branch_offset[2]}]
set_input_delay -clock v_clk  1  [get_ports {branch_offset[1]}]
set_input_delay -clock v_clk  1  [get_ports {branch_offset[0]}]
set_output_delay -clock v_clk  1  [get_ports {mem_addr[7]}]
set_output_delay -clock v_clk  1  [get_ports {mem_addr[6]}]
set_output_delay -clock v_clk  1  [get_ports {mem_addr[5]}]
set_output_delay -clock v_clk  1  [get_ports {mem_addr[4]}]
set_output_delay -clock v_clk  1  [get_ports {mem_addr[3]}]
set_output_delay -clock v_clk  1  [get_ports {mem_addr[2]}]
set_output_delay -clock v_clk  1  [get_ports {mem_addr[1]}]
set_output_delay -clock v_clk  1  [get_ports {mem_addr[0]}]
set_input_transition -max -rise 0.1  [get_ports clk]
set_input_transition -max -fall 0.12  [get_ports clk]
set_input_transition -min -rise 0.1  [get_ports clk]
set_input_transition -min -fall 0.12  [get_ports clk]
set_input_transition -max -rise 0.1  [get_ports rst_n]
set_input_transition -max -fall 0.12  [get_ports rst_n]
set_input_transition -min -rise 0.1  [get_ports rst_n]
set_input_transition -min -fall 0.12  [get_ports rst_n]
set_input_transition -max -rise 0.1  [get_ports update_msbs]
set_input_transition -max -fall 0.12  [get_ports update_msbs]
set_input_transition -min -rise 0.1  [get_ports update_msbs]
set_input_transition -min -fall 0.12  [get_ports update_msbs]
set_input_transition -max -rise 0.1  [get_ports update_lsbs]
set_input_transition -max -fall 0.12  [get_ports update_lsbs]
set_input_transition -min -rise 0.1  [get_ports update_lsbs]
set_input_transition -min -fall 0.12  [get_ports update_lsbs]
set_input_transition -max -rise 0.1  [get_ports jump]
set_input_transition -max -fall 0.12  [get_ports jump]
set_input_transition -min -rise 0.1  [get_ports jump]
set_input_transition -min -fall 0.12  [get_ports jump]
set_input_transition -max -rise 0.1  [get_ports {jump_destination[5]}]
set_input_transition -max -fall 0.12  [get_ports {jump_destination[5]}]
set_input_transition -min -rise 0.1  [get_ports {jump_destination[5]}]
set_input_transition -min -fall 0.12  [get_ports {jump_destination[5]}]
set_input_transition -max -rise 0.1  [get_ports {jump_destination[4]}]
set_input_transition -max -fall 0.12  [get_ports {jump_destination[4]}]
set_input_transition -min -rise 0.1  [get_ports {jump_destination[4]}]
set_input_transition -min -fall 0.12  [get_ports {jump_destination[4]}]
set_input_transition -max -rise 0.1  [get_ports {jump_destination[3]}]
set_input_transition -max -fall 0.12  [get_ports {jump_destination[3]}]
set_input_transition -min -rise 0.1  [get_ports {jump_destination[3]}]
set_input_transition -min -fall 0.12  [get_ports {jump_destination[3]}]
set_input_transition -max -rise 0.1  [get_ports {jump_destination[2]}]
set_input_transition -max -fall 0.12  [get_ports {jump_destination[2]}]
set_input_transition -min -rise 0.1  [get_ports {jump_destination[2]}]
set_input_transition -min -fall 0.12  [get_ports {jump_destination[2]}]
set_input_transition -max -rise 0.1  [get_ports {jump_destination[1]}]
set_input_transition -max -fall 0.12  [get_ports {jump_destination[1]}]
set_input_transition -min -rise 0.1  [get_ports {jump_destination[1]}]
set_input_transition -min -fall 0.12  [get_ports {jump_destination[1]}]
set_input_transition -max -rise 0.1  [get_ports {jump_destination[0]}]
set_input_transition -max -fall 0.12  [get_ports {jump_destination[0]}]
set_input_transition -min -rise 0.1  [get_ports {jump_destination[0]}]
set_input_transition -min -fall 0.12  [get_ports {jump_destination[0]}]
set_input_transition -max -rise 0.1  [get_ports branch]
set_input_transition -max -fall 0.12  [get_ports branch]
set_input_transition -min -rise 0.1  [get_ports branch]
set_input_transition -min -fall 0.12  [get_ports branch]
set_input_transition -max -rise 0.1  [get_ports {branch_offset[5]}]
set_input_transition -max -fall 0.12  [get_ports {branch_offset[5]}]
set_input_transition -min -rise 0.1  [get_ports {branch_offset[5]}]
set_input_transition -min -fall 0.12  [get_ports {branch_offset[5]}]
set_input_transition -max -rise 0.1  [get_ports {branch_offset[4]}]
set_input_transition -max -fall 0.12  [get_ports {branch_offset[4]}]
set_input_transition -min -rise 0.1  [get_ports {branch_offset[4]}]
set_input_transition -min -fall 0.12  [get_ports {branch_offset[4]}]
set_input_transition -max -rise 0.1  [get_ports {branch_offset[3]}]
set_input_transition -max -fall 0.12  [get_ports {branch_offset[3]}]
set_input_transition -min -rise 0.1  [get_ports {branch_offset[3]}]
set_input_transition -min -fall 0.12  [get_ports {branch_offset[3]}]
set_input_transition -max -rise 0.1  [get_ports {branch_offset[2]}]
set_input_transition -max -fall 0.12  [get_ports {branch_offset[2]}]
set_input_transition -min -rise 0.1  [get_ports {branch_offset[2]}]
set_input_transition -min -fall 0.12  [get_ports {branch_offset[2]}]
set_input_transition -max -rise 0.1  [get_ports {branch_offset[1]}]
set_input_transition -max -fall 0.12  [get_ports {branch_offset[1]}]
set_input_transition -min -rise 0.1  [get_ports {branch_offset[1]}]
set_input_transition -min -fall 0.12  [get_ports {branch_offset[1]}]
set_input_transition -max -rise 0.1  [get_ports {branch_offset[0]}]
set_input_transition -max -fall 0.12  [get_ports {branch_offset[0]}]
set_input_transition -min -rise 0.1  [get_ports {branch_offset[0]}]
set_input_transition -min -fall 0.12  [get_ports {branch_offset[0]}]
